{
  "super": [
    {
      "username": "islamghany",
      "password": "labooktory",
      "id": 1
    }
  ],
  "books": [
    {
      "id": 1,
      "name": "The 5 Love Languages: The Secret to Love that Lasts",
      "author": "Gary Chapman",
      "rate": 5,
      "comeout": "January 1, 2015",
      "type": "Arts & Photography",
      "isbn": "978-0802412706",
      "pages": 208,
      "title": "Simple ideas, lasting love",
      "des": "Falling in love is easy. Staying in love—that’s the challenge. How can you keep your relationship fresh and growing amid the demands, conflicts, and just plain boredom of everyday life? In the #1 New York Times bestseller The 5 Love Languages, you’ll discover the secret that has transformed millions of relationships worldwide. Whether your relationship is flourishing or failing, Dr. Gary Chapman’s proven approach to showing and receiving love will help you experience deeper and richer levels of intimacy with your partner—starting today. The 5 Love Languages is as practical as it is insightful. Updated to reflect the complexities of relationships today, this new edition reveals intrinsic truths and applies relevant, actionable wisdom in ways that work. ncludes the Couple's Personal Profile assessment so you can discover your love language and that of your loved one tow.",
      "img": "https://images-na.ssl-images-amazon.com/images/I/41ILRrgp5-L._SX322_BO1,204,203,200_.jpg",
      "download": "http://93.174.95.29/_ads/658CD82115C18602F93DC3B813778882",
      "  downloadTime": 50
    },
    {
      "id": 2,
      "name": "Essential Elements for Strings - Book 1 with EEi: Violin",
      "author": " Michael Allen, Robert Gillespie And Pamela Tellejohn Hayes",
      "rate": 4,
      "comeout": "July 1, 2002",
      "type": "Arts & Photography",
      "isbn": "978-0634038174",
      "pages": 48,
      "title": "Simple ideas",
      "des": "(Essential Elements for Strings). (Essential Elements for Strings and Essential Elements Interactive are fully compatible with Essential Elements 2000 for Strings) Essential Elements for Strings offers beginning students sound pedagogy and engaging music, all carefully paced to successfully start young players on their musical journey. EE features both familiar songs and specially designed exercises, created and arranged for the classroom in a unison-learning environment, as well as instrument-specific exercises to focus each student on the unique characteristics of their own instrument. EE provides both teachers and students with a wealth of materials to develop total musicianship, even at the beginning stages. Books 1 and 2 also include access to Essential Elements Interactive (EEi) , the ultimate online music education resource - anywhere, anytime, and on any device. Go to www.essentialelementsinteractive.com to learn more! Method features: * Enhanced Starting System * Optimum Reinforced Learning * Pacing * Theory, History, Cross-Curriculum & Creativity * Performance Spotlights Book also includes My EE Library * (www.myeelibrary.com) -",
      "img": "https://images-na.ssl-images-amazon.com/images/I/51aulVWqyZL._SX373_BO1,204,203,200_.jpg",
      "download": "http://93.174.95.29/_ads/013938D7C969537E957A1E7CBB6B769F",
      "downloadTime": 60
    },
    {
      "id": 3,
      "name": "Washington: A Life",
      "author": " Ron Chernow",
      "rate": 4,
      "comeout": "October 5, 2010",
      "type": "Biographies & Memoirs",
      "isbn": "1-101-44018-X",
      "pages": 930,
      "title": "A gripping portrait of the first president of the United States from the author of Alexander Hamilton, the New York Times bestselling biography that inspired the musical.",
      "des": "Celebrated biographer Ron Chernow provides a richly nuanced portrait of the father of our nation and the first president of the United States. With a breadth and depth matched by no other one volume biography of George Washington, this crisply paced narrative carries the reader through his adventurous early years, his heroic exploits with the Continental Army during the Revolutionary War, his presiding over the Constitutional Convention, and his magnificent performance as America's first president. In this groundbreaking work, based on massive research, Chernow shatters forever the stereotype of George Washington as a stolid, unemotional figure and brings to vivid life a dashing, passionate man of fiery opinions and many moods.",
      "img": "https://images-na.ssl-images-amazon.com/images/I/51zuqTlFTDL.jpg",
      "download": "http://93.174.95.29/_ads/D2E142E8C25D4F6C5317553D060EE0BD",
      "downloadTime": 10
    },
    {
      "id": 4,
      "name": "Born Survivors ",
      "author": "Holden, Wendy",
      "rate": 5,
      "comeout": "October 5, 2010",
      "type": "Biographies & Memoirs",
      "isbn": "0751557382,9780751557381",
      "pages": 930,
      "title": "Three Young Mothers and Their Extraordinary Story of Courage, Defiance, and Hope",
      "des": "The Nazis murdered their husbands but concentration camp prisoners Priska, Rachel, and Anka would not let evil take their unborn children too—a remarkable true story that will appeal to readers of The Lost and The Nazi Officer’s Wife, Born Survivors celebrates three mothers who defied death to give their children life. Eastern Europe, 1944: Three women believe they are pregnant, but are torn from their husbands before they can be certain. Rachel is sent to Auschwitz, unaware that her husband has been shot. Priska and her husband travel there together, but are immediately separated. Also at Auschwitz, Anka hopes in vain to be reunited with her husband. With the rest of their families gassed, these young wives are determined to hold on to all they have left—their lives, and those of their unborn babies. Having concealed their condition from infamous Nazi doctor Josef Mengele, they are forced to work and almost starved to death, living in daily fear of their pregnancies being detected by the SS",
      "img": "https://images-na.ssl-images-amazon.com/images/I/51xVPLrt1jL.jpg",
      "download": "http://93.174.95.29/_ads/888D560F6945EE0B726BB1CE5BB9C119",
      "downloadTime": 30
    },
    {
      "name": "Introduction to Algorithms, 3rd Edition",
      "isbn": "978-0262033848",
      "author": "Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, Clifford Stein",
      "rate": "5",
      "img": "https://books.google.com.eg/books/content?id=i-bUBQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&imgtk=AFLRE70eVCOUua4uHPbiNr4FkToUQL6dy3ySfzrTjxKkiPxZUVhVqkozjm6wIugr5R8Y-M-cmEDaQpo4i0_yE3ECNLTLdp2-T6XkkrLyedqi7vmMSdBrh-f8-E4xaQRF3q3XIorqsfRp",
      "download": "http://93.174.95.29/_ads/A534ADBA70D6CF1EF1139C71E9000681",
      "title": "The latest edition of the essential text and professional reference, with substantial new material on such topics as vEB trees, multithreaded algorithms, dynamic programming, and edge-based flow.",
      "type": "Computer Sience",
      "des": "Some books on algorithms are rigorous but incomplete; others cover masses of material but lack rigor. Introduction to Algorithms uniquely combines rigor and comprehensiveness. The book covers a broad range of algorithms in depth, yet makes their design and analysis accessible to all levels of readers. Each chapter is relatively self-contained and can be used as a unit of study. The algorithms are described in English and in a pseudocode designed to be readable by anyone who has done a little programming. The explanations have been kept elementary without sacrificing depth of coverage or mathematical rigor",
      "pages": "1290",
      "id": 6,
      "downloadTime": 99,
      "comeout": "October 24 2012"
    },
    {
      "id": 5,
      "name": "Tribe of Mentors: Short Life Advice from the Best in the World",
      "author": "Timothy Ferriss",
      "rate": 5,
      "comeout": "October 5, 2010",
      "type": "Biographies & Memoirs",
      "isbn": "1328994961,9781328994967",
      "pages": 623,
      "title": "We All Need Mentors. Here Are More than 100 of the World’s Best",
      "des": "Were my goals my own, or simply what I thought I should want? How much of life had I missed from underplanning or overplanning?  How could I be kinder to myself?How could I better say “no” to the trivial many to better say “yes” to the critical few? How could I best reassess my priorities and my purpose in this world? o find answers, I reached out to the most impressive world-class performers in the world, ranging from wunderkinds in their 20s to icons in their 70s and 80s. No stone was left unturned This book contains their answers—practical and tactical advice from mentors who have found solutions. Whether you want to 10x your results, get unstuck, or reinvent yourself, someone else has traveled a similar path and taken notes",
      "img": "https://images-na.ssl-images-amazon.com/images/I/51jkW-GzFiL.jpg",
      "download": "http://93.174.95.29/_ads/4B4526C25F593954876BE633B03C9980",
      "downloadTime": 45
    },
    {
      "img": "https://books.google.com/books/content/images/frontcover/O9DcDgAAQBAJ?fife=w200-h300",
      "name": "C++ Data Structures and Algorithms",
      "title": "Learn how to write efficient code to build scalable and robust applications in C++‏",
      "des": "Data structures allow organizing data efficiently. They are critical to various problems and their suitable implementation can provide a complete solution that acts like reusable code. In this book, you will learn how to use various data structures while developing in the C# language as well as how to implement some of the most common algorithms used with such data structures.\n\nAt the beginning, you will get to know arrays, lists, dictionaries, and sets together with real-world examples of your application. Then, you will learn how to create and use stacks and queues. In the following part of the book, the more complex data structures will be introduced, namely trees and graphs, together with some algorithms for searching the shortest path in a graph. We will also discuss how to organize the code in a manageable, consistent, and extendable way. By the end of the book,you will learn how to build components that are easy to understand, debug, and use in different applications.",
      "type": "name",
      "isbn": "17888337324",
      "rate": "5",
      "download": "http://93.174.95.29/_ads/3C76F0C12D81CDAF5F8D7BD619BC93D7",
      "comeout": "October 10  2018",
      "author": "Wisnu Anggoro",
      "pages": "370",
      "id": 7
    },
    {
      "img": "https://images1.penguinrandomhouse.com/cover/9780517887295",
      "pages": "592",
      "isbn": "978-0517887295",
      "rate": "5",
      "comeout": "Apr 02, 1996",
      "author": "Graham Hancock",
      "name": "Fingerprints of the Gods",
      "title": "“A fancy piece of historical sleuthing . . . intriguing and entertaining and sturdy enough to give a long pause for thought.”",
      "download": "http://93.174.95.29/_ads/B82E8245873F7C2AAF720D302BB9CC80",
      "des": "In Fingerprints of the Gods, Hancock embarks on a worldwide quest to put together all the pieces of the vast and fascinating jigsaw of mankind’s hidden past. In ancient monuments as far apart as Egypt’s Great Sphinx, the strange Andean ruins of Tihuanaco, and Mexico’s awe-inspiring Temples of the Sun and Moon, he reveals not only the clear fingerprints of an as-yet-unidentified civilization of remote antiquity, but also startling evidence of its vast sophistication, technological advancement, and evolved scientific knowledge.",
      "cate": "History",
      "id": 8,
      "type": "History"
    },
    {
      "name": "Pride and Prejudice",
      "author": "Jane Austen",
      "pages": "265",
      "rate": "5",
      "img": "https://images3.penguinrandomhouse.com/cover/9789380028743",
      "download": "http://93.174.95.29/_ads/AB13556B96D473C8DFAD7165C4704526",
      "type": "Literature & Fiction",
      "isbn": "9789380028743",
      "comeout": " December 3, 2011",
      "des": "One of the most famous opening lines in English literature, the most compelling of stories, and a host of vivid characters, has won Pride and Prejudice its rightful pride-of-place on bookshelves throughout the world. For Mr Bennet, a quiet life is to be highly commended. For Mrs Bennet, finding eligible husbands for her five daughters is the most important of a mother’s duties. For Elizabeth, marrying without affection is unthinkable. But for them all, life is about to change when a handsome young man and his equally handsome and wealthy companion, take residence nearby.",
      "title": "handsome young man and his equally handsome and wealthy companion, take residence nearby.",
      "id": 9
    },
    {
      "img": "https://images3.penguinrandomhouse.com/cover/9789380741239",
      "download": "http://93.174.95.29/_ads/58AC996441C274E30C902A50A5E4263D",
      "name": "Muhammad Ali. The King of the Ring",
      "author": "Lewis Helfand,Lalit Kumar Sharma",
      "comeout": "Jan 31, 2012",
      "rate": "5",
      "isbn": "9789380741239 ",
      "title": "ABOUT MUHAMMAD ALI: THE KING OF THE RING",
      "pages": "94",
      "type": "Biographies & Memoirs",
      "des": "Muhammad Ali was born Cassius Marcellus Clay, Jr. in 1942. A three-time World Heavyweight Champion he is widely considered one of the greatest boxers of all time. But Ali’s legacy reaches far beyond the world of sports. He changed his name from Clay to Ali after joining the Nation of Islam in 1964, and refused to join the U.S. military during the Vietnam War, facing arrest and losing his boxing title and the right to fight for four years because of his beliefs. After returning to the ring after a four-year forced absence, he participated in several of the most memorable and historic boxing matches of all time. He was known for his charisma, sharp intellect and wit, and also his rhymes, making him a cultural icon and one of the most recognized and inspiring people on the planet. Nicknamed “The Greatest”, Ali’s personal story is one for the ages. Campfire’s biography of Muhammad Ali will teach, inspire and entertain young readers.",
      "id": 10
    }
  ]
}